In [13]:
import numpy as np
import pandas as pd
import altair as alt

In [37]:
gender_data = pd.read_csv('gender.csv')
gender_data_raw = pd.read_csv('gender-raw-fixed.csv') # this is the gender-raw-2021.csv file, but with the first couple rows removed b/c they were not parsable
metadata_country_api = pd.read_csv('Metadata_Country_API_17_DS2_en_csv_v2_3058240.csv')
metadata_indicator_api = pd.read_csv('Metadata_Indicator_API_17_DS2_en_csv_v2_3058240.csv')

In [22]:
usa_data = gender_data[gender_data['Country Code'] == 'USA']
usa_data.sort_values('Year')

,Country Name,Country Code,Year,"average_value_Adjusted net enrollment rate, primary, female (% of primary school age children)","average_value_Adjusted net enrollment rate, primary, male (% of primary school age children)","average_value_Adolescent fertility rate (births per 1,000 women ages 15-19)",average_value_Births attended by skilled health staff (% of total),"average_value_Children out of school, primary, female","average_value_Children out of school, primary, male","average_value_Educational attainment, Doctoral or equivalent, population 25+, female (%) (cumulative)",...,"average_value_School enrollment, tertiary, female (% gross)","average_value_School enrollment, tertiary, male (% gross)","average_value_Secondary education, general pupils (% female)","average_value_Secondary education, pupils (% female)","average_value_Secondary education, teachers (% female)","average_value_Secondary education, vocational pupils (% female)","average_value_Survival to age 65, female (% of cohort)","average_value_Survival to age 65, male (% of cohort)","average_value_Trained teachers in primary education, female (% of female teachers)","average_value_Trained teachers in primary education, male (% of male teachers)"
1734,United States,USA,1960,NaN,NaN,81.7410,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,78.311575,63.960704,NaN,NaN
5776,United States,USA,1961,NaN,NaN,79.1850,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,78.466188,64.011012,NaN,NaN
7745,United States,USA,1962,NaN,NaN,76.6290,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,78.620801,64.061320,NaN,NaN
8229,United States,USA,1963,NaN,NaN,74.6802,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,78.749580,64.005645,NaN,NaN
9300,United States,USA,1964,NaN,NaN,72.7314,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,78.878359,63.949971,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1425,United States,USA,2016,99.56904,99.70812,21.4754,99.1,52078.0,36772.0,1.48143,...,102.293800,76.062271,48.78903,48.78903,NaN,NaN,87.577625,79.880691,NaN,NaN
7978,United States,USA,2017,95.51193,95.60171,19.8600,99.1,NaN,NaN,NaN,...,102.011330,74.997192,48.81884,48.81884,62.646591,NaN,87.471366,79.690985,NaN,NaN
7658,United States,USA,2018,NaN,NaN,18.5562,99.1,76669.0,64864.0,1.64229,...,102.354042,74.895050,NaN,NaN,NaN,NaN,87.542636,79.804123,NaN,NaN
1909,United States,USA,2019,NaN,NaN,17.2524,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,87.613906,79.917260,NaN,NaN
449,United States,USA,2020,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [121]:
gender_data_raw_us = gender_data_raw.drop('Indicator Code', 1).drop('Country Name', 1).drop('Country Code', 1).reset_index(drop=True,inplace=True)
gender_data_raw_us

C:\Users\rhkev\AppData\Local\Temp/ipykernel_27860/4267632412.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  gender_data_raw_us = gender_data_raw.drop('Indicator Code', 1).drop('Country Name', 1).drop('Country Code', 1).reset_index(drop=True,inplace=True)

In [69]:
employment_data = gender_data_raw_us[['Unemployment, male (% of male labor force) (modeled ILO estimate)', 'Unemployment, female (% of female labor force) (modeled ILO estimate)']]
employment_data

Indicator Name,"Unemployment, male (% of male labor force) (modeled ILO estimate)","Unemployment, female (% of female labor force) (modeled ILO estimate)"
1960,NaN,NaN
1961,NaN,NaN
1962,NaN,NaN
1963,NaN,NaN
1964,NaN,NaN
...,...,...
2016,4.94,4.79
2017,4.40,4.31
2018,3.95,3.84
2019,3.72,3.61
2020,NaN,NaN